In [1]:
from pymongo import MongoClient

In [2]:
client = MongoClient(
    host = 'localhost',
    port = 27017
)  #클래스에 인자값 넣어주는 개념입니다~

In [3]:
client.list_database_names()  #show.dbs

['admin', 'config', 'local', 'test_database', 'ubion']

In [4]:
db = client["ubion"]
list(db["test"].find())  # test collection을 리스트로 보여주기 . find가 메소드 역할 
#list(db.test.find())

[{'_id': ObjectId('62328e7e77d05738d621314c'),
  'name': 'test',
  'phone': '01012345678'},
 {'_id': ObjectId('6232905f77d05738d621314e'), 'loc': 'Seoul'},
 {'_id': ObjectId('6232905f77d05738d621314f'),
  'gender': 'male',
  'age': 20.0,
  'hobby': 'soccer'},
 {'_id': ObjectId('6232919b77d05738d6213150'), 'name': 'test2', 'age': 25.0},
 {'_id': ObjectId('6232981b61d23334044e7618'), '1': '1', '2': '2', '3': '3'},
 {'_id': ObjectId('6232999e61d23334044e7619'), 'a': 'a', 'b': 'b'},
 {'_id': ObjectId('6232999e61d23334044e761a'), 'c': 'c', 'd': 'd'}]

In [5]:
data = {
    "1" :"1",
    "2" :"2",
    "3" : "3"
}

db.test.insert_one(data)

In [6]:
data_2 = [{
    "a":"a",
    "b":"b"
},{
    "c":"c",
    "d":"d"
}]

db.test.insert_many(data_2)

In [7]:
list(db.test.find())

[{'_id': ObjectId('62328e7e77d05738d621314c'),
  'name': 'test',
  'phone': '01012345678'},
 {'_id': ObjectId('6232905f77d05738d621314e'), 'loc': 'Seoul'},
 {'_id': ObjectId('6232905f77d05738d621314f'),
  'gender': 'male',
  'age': 20.0,
  'hobby': 'soccer'},
 {'_id': ObjectId('6232919b77d05738d6213150'), 'name': 'test2', 'age': 25.0},
 {'_id': ObjectId('6232981b61d23334044e7618'), '1': '1', '2': '2', '3': '3'},
 {'_id': ObjectId('6232999e61d23334044e7619'), 'a': 'a', 'b': 'b'},
 {'_id': ObjectId('6232999e61d23334044e761a'), 'c': 'c', 'd': 'd'},
 {'_id': ObjectId('6233d7cf848b5387ecbb9a5f'), '1': '1', '2': '2', '3': '3'},
 {'_id': ObjectId('6233d7cf848b5387ecbb9a60'), 'a': 'a', 'b': 'b'},
 {'_id': ObjectId('6233d7cf848b5387ecbb9a61'), 'c': 'c', 'd': 'd'}]

In [8]:
import m_sql

In [9]:
import pandas as pd

In [10]:
_db = m_sql.Database()

OperationalError: (2003, "Can't connect to MySQL server on 'darkpreist.iptime.org' (timed out)")

In [ ]:
sql = '''
        SELECT * FROM emp
        '''
result = _db.executeAll(sql)
pd.DataFrame(result).to_csv("emp.csv")

In [ ]:
db.emp.find_one()  #맨 위에 값 하나

{'_id': ObjectId('6232b7199dd8bbbf15a2530b'),
 'EMPNO': '7369',
 'ENAME': 'SMITH',
 'JOB': 'CLERK',
 'MGR': '7902',
 'HIREDATE': '1980-12-17',
 'SAL': '800.00',
 'DEPTNO': '20'}

In [11]:
list(db.emp.find(
    {"ENAME":"SMITH"}
))
# SELECT*FROM emp WHERE ENAME="SMITH"
# 앞에 list 붙여줘야 값 출력됨.

[{'_id': ObjectId('6232c6b91a203e5f7ba0da5d'),
  'EMPNO': 7369,
  'ENAME': 'SMITH',
  'JOB': 'CLERK',
  'MGR': 7902,
  'HIREDATE': '1980-12-17',
  'SAL': 800.0,
  'DEPTNO': '20'}]

In [12]:
result = db.emp.find()
for list in result:
    print(list)

{'_id': ObjectId('6232c6b91a203e5f7ba0da5d'), 'EMPNO': 7369, 'ENAME': 'SMITH', 'JOB': 'CLERK', 'MGR': 7902, 'HIREDATE': '1980-12-17', 'SAL': 800.0, 'DEPTNO': '20'}
{'_id': ObjectId('6232c6b91a203e5f7ba0da5e'), 'EMPNO': 7499, 'ENAME': 'ALLEN', 'JOB': 'SALESMAN', 'MGR': 7698, 'HIREDATE': '1981-02-20', 'SAL': 1600.0, 'COMM': 300.0, 'DEPTNO': '30'}
{'_id': ObjectId('6232c6b91a203e5f7ba0da5f'), 'EMPNO': 7521, 'ENAME': 'WARD', 'JOB': 'SALESMAN', 'MGR': 7698, 'HIREDATE': '1981-02-22', 'SAL': 1250.0, 'COMM': 500.0, 'DEPTNO': '30'}
{'_id': ObjectId('6232c6b91a203e5f7ba0da60'), 'EMPNO': 7566, 'ENAME': 'JONES', 'JOB': 'MANAGER', 'MGR': 7839, 'HIREDATE': '1981-04-02', 'SAL': 2975.0, 'DEPTNO': '20'}
{'_id': ObjectId('6232c6b91a203e5f7ba0da61'), 'EMPNO': 7654, 'ENAME': 'MARTIN', 'JOB': 'SALESMAN', 'MGR': 7698, 'HIREDATE': '1981-09-28', 'SAL': 1250.0, 'COMM': 1400.0, 'DEPTNO': '30'}
{'_id': ObjectId('6232c6b91a203e5f7ba0da62'), 'EMPNO': 7698, 'ENAME': 'BLAKE', 'JOB': 'MANAGER', 'MGR': 7839, 'HIREDATE': '1981-05-01', 'SAL': 2850.0, 'DEPTNO': '30'}
{'_id': ObjectId('6232c6b91a203e5f7ba0da63'), 'EMPNO': 7782, 'ENAME': 'CLARK', 'JOB': 'MANAGER', 'MGR': 7839, 'HIREDATE': '1981-06-09', 'SAL': 2450.0, 'DEPTNO': '10'}
{'_id': ObjectId('6232c6b91a203e5f7ba0da64'), 'EMPNO': 7788, 'ENAME': 'SCOTT', 'JOB': 'ANALYST', 'MGR': 7566, 'HIREDATE': '1987-06-28', 'SAL': 3000.0, 'DEPTNO': '20'}
{'_id': ObjectId('6232c6b91a203e5f7ba0da65'), 'EMPNO': 7839, 'ENAME': 'KING', 'JOB': 'PRESIDENT', 'HIREDATE': '1981-11-17', 'SAL': 5000.0, 'DEPTNO': '10'}
{'_id': ObjectId('6232c6b91a203e5f7ba0da66'), 'EMPNO': 7844, 'ENAME': 'TURNER', 'JOB': 'SALESMAN', 'MGR': 7698, 'HIREDATE': '1981-09-08', 'SAL': 1500.0, 'COMM': 0.0, 'DEPTNO': '30'}
{'_id': ObjectId('6232c6b91a203e5f7ba0da67'), 'EMPNO': 7876, 'ENAME': 'ADAMS', 'JOB': 'CLERK', 'MGR': 7788, 'HIREDATE': '1987-07-13', 'SAL': 1100.0, 'DEPTNO': '20'}
{'_id': ObjectId('6232c6b91a203e5f7ba0da68'), 'EMPNO': 7900, 'ENAME': 'JAMES', 'JOB': 'CLERK', 'MGR': 7698, 'HIREDATE': '1981-12-03', 'SAL': 950.0, 'DEPTNO': '30'}
{'_id': ObjectId('6232c6b91a203e5f7ba0da69'), 'EMPNO': 7902, 'ENAME': 'FORD', 'JOB': 'ANALYST', 'MGR': 7566, 'HIREDATE': '1981-12-03', 'SAL': 3000.0, 'DEPTNO': '20'}
{'_id': ObjectId('6232c6b91a203e5f7ba0da6a'), 'EMPNO': 7934, 'ENAME': 'MILLER', 'JOB': 'CLERK', 'MGR': 7782, 'HIREDATE': '1982-01-23', 'SAL': 1300.0, 'DEPTNO': '10'}

In [13]:
# emp collection에서 key 값이 EMPNO, ENAME, DEPTNO
# 첫 {} : where 절 , 두번째 {}: column절
pd.DataFrame(db.emp.find(
    {},{"EMPNO" :1,
    "ENAME":1,
    "DEPTNO":1,
    "_id":0}))

    EMPNO   ENAME DEPTNO
0    7369   SMITH     20
1    7499   ALLEN     30
2    7521    WARD     30
3    7566   JONES     20
4    7654  MARTIN     30
5    7698   BLAKE     30
6    7782   CLARK     10
7    7788   SCOTT     20
8    7839    KING     10
9    7844  TURNER     30
10   7876   ADAMS     20
11   7900   JAMES     30
12   7902    FORD     20
13   7934  MILLER     10

In [ ]:
pd.DataFrame(db.emp.find({},{"_id":0}).sort("ENAME"))

# SELECT *FROM emp ORDER BY ENAME

    EMPNO   ENAME        JOB     MGR    HIREDATE     SAL DEPTNO    COMM
0    7876   ADAMS      CLERK  7788.0  1987-07-13  1100.0     20     NaN
1    7499   ALLEN   SALESMAN  7698.0  1981-02-20  1600.0     30   300.0
2    7698   BLAKE    MANAGER  7839.0  1981-05-01  2850.0     30     NaN
3    7782   CLARK    MANAGER  7839.0  1981-06-09  2450.0     10     NaN
4    7902    FORD    ANALYST  7566.0  1981-12-03  3000.0     20     NaN
5    7900   JAMES      CLERK  7698.0  1981-12-03   950.0     30     NaN
6    7566   JONES    MANAGER  7839.0  1981-04-02  2975.0     20     NaN
7    7839    KING  PRESIDENT     NaN  1981-11-17  5000.0     10     NaN
8    7654  MARTIN   SALESMAN  7698.0  1981-09-28  1250.0     30  1400.0
9    7934  MILLER      CLERK  7782.0  1982-01-23  1300.0     10     NaN
10   7788   SCOTT    ANALYST  7566.0  1987-06-28  3000.0     20     NaN
11   7369   SMITH      CLERK  7902.0  1980-12-17   800.0     20     NaN
12   7844  TURNER   SALESMAN  7698.0  1981-09-08  1500.0     30     0.0
13   7521    WARD   SALESMAN  7698.0  1981-02-22  1250.0     30   500.0

In [ ]:
# 급여 2000이상 출력
result_2 = db.emp.find(
    {
        "SAL": {
            "$gt" : 2000
        }
    }
)
list(result_2)

[{'_id': ObjectId('6232c6b91a203e5f7ba0da60'),
  'EMPNO': 7566,
  'ENAME': 'JONES',
  'JOB': 'MANAGER',
  'MGR': 7839,
  'HIREDATE': '1981-04-02',
  'SAL': 2975.0,
  'DEPTNO': '20'},
 {'_id': ObjectId('6232c6b91a203e5f7ba0da62'),
  'EMPNO': 7698,
  'ENAME': 'BLAKE',
  'JOB': 'MANAGER',
  'MGR': 7839,
  'HIREDATE': '1981-05-01',
  'SAL': 2850.0,
  'DEPTNO': '30'},
 {'_id': ObjectId('6232c6b91a203e5f7ba0da63'),
  'EMPNO': 7782,
  'ENAME': 'CLARK',
  'JOB': 'MANAGER',
  'MGR': 7839,
  'HIREDATE': '1981-06-09',
  'SAL': 2450.0,
  'DEPTNO': '10'},
 {'_id': ObjectId('6232c6b91a203e5f7ba0da64'),
  'EMPNO': 7788,
  'ENAME': 'SCOTT',
  'JOB': 'ANALYST',
  'MGR': 7566,
  'HIREDATE': '1987-06-28',
  'SAL': 3000.0,
  'DEPTNO': '20'},
 {'_id': ObjectId('6232c6b91a203e5f7ba0da65'),
  'EMPNO': 7839,
  'ENAME': 'KING',
  'JOB': 'PRESIDENT',
  'HIREDATE': '1981-11-17',
  'SAL': 5000.0,
  'DEPTNO': '10'},
 {'_id': ObjectId('6232c6b91a203e5f7ba0da69'),
  'EMPNO': 7902,
  'ENAME': 'FORD',
  'JOB': 'ANALYST',
  'MGR': 7566,
  'HIREDATE': '1981-12-03',
  'SAL': 3000.0,
  'DEPTNO': '20'}]

In [ ]:
result_3 = db.emp.find(
    {
        "SAL": {
            "$gte" : 2450
        }
    }
)
list(result_3)
# $gte : >=

[{'_id': ObjectId('6232c6b91a203e5f7ba0da60'),
  'EMPNO': 7566,
  'ENAME': 'JONES',
  'JOB': 'MANAGER',
  'MGR': 7839,
  'HIREDATE': '1981-04-02',
  'SAL': 2975.0,
  'DEPTNO': '20'},
 {'_id': ObjectId('6232c6b91a203e5f7ba0da62'),
  'EMPNO': 7698,
  'ENAME': 'BLAKE',
  'JOB': 'MANAGER',
  'MGR': 7839,
  'HIREDATE': '1981-05-01',
  'SAL': 2850.0,
  'DEPTNO': '30'},
 {'_id': ObjectId('6232c6b91a203e5f7ba0da63'),
  'EMPNO': 7782,
  'ENAME': 'CLARK',
  'JOB': 'MANAGER',
  'MGR': 7839,
  'HIREDATE': '1981-06-09',
  'SAL': 2450.0,
  'DEPTNO': '10'},
 {'_id': ObjectId('6232c6b91a203e5f7ba0da64'),
  'EMPNO': 7788,
  'ENAME': 'SCOTT',
  'JOB': 'ANALYST',
  'MGR': 7566,
  'HIREDATE': '1987-06-28',
  'SAL': 3000.0,
  'DEPTNO': '20'},
 {'_id': ObjectId('6232c6b91a203e5f7ba0da65'),
  'EMPNO': 7839,
  'ENAME': 'KING',
  'JOB': 'PRESIDENT',
  'HIREDATE': '1981-11-17',
  'SAL': 5000.0,
  'DEPTNO': '10'},
 {'_id': ObjectId('6232c6b91a203e5f7ba0da69'),
  'EMPNO': 7902,
  'ENAME': 'FORD',
  'JOB': 'ANALYST',
  'MGR': 7566,
  'HIREDATE': '1981-12-03',
  'SAL': 3000.0,
  'DEPTNO': '20'}]

In [ ]:
result_4 = db.emp.find(
    {
        "SAL": {
            "$lte" : 2450
        }
    }
)
list(result_4)

[{'_id': ObjectId('6232c6b91a203e5f7ba0da5d'),
  'EMPNO': 7369,
  'ENAME': 'SMITH',
  'JOB': 'CLERK',
  'MGR': 7902,
  'HIREDATE': '1980-12-17',
  'SAL': 800.0,
  'DEPTNO': '20'},
 {'_id': ObjectId('6232c6b91a203e5f7ba0da5e'),
  'EMPNO': 7499,
  'ENAME': 'ALLEN',
  'JOB': 'SALESMAN',
  'MGR': 7698,
  'HIREDATE': '1981-02-20',
  'SAL': 1600.0,
  'COMM': 300.0,
  'DEPTNO': '30'},
 {'_id': ObjectId('6232c6b91a203e5f7ba0da5f'),
  'EMPNO': 7521,
  'ENAME': 'WARD',
  'JOB': 'SALESMAN',
  'MGR': 7698,
  'HIREDATE': '1981-02-22',
  'SAL': 1250.0,
  'COMM': 500.0,
  'DEPTNO': '30'},
 {'_id': ObjectId('6232c6b91a203e5f7ba0da61'),
  'EMPNO': 7654,
  'ENAME': 'MARTIN',
  'JOB': 'SALESMAN',
  'MGR': 7698,
  'HIREDATE': '1981-09-28',
  'SAL': 1250.0,
  'COMM': 1400.0,
  'DEPTNO': '30'},
 {'_id': ObjectId('6232c6b91a203e5f7ba0da63'),
  'EMPNO': 7782,
  'ENAME': 'CLARK',
  'JOB': 'MANAGER',
  'MGR': 7839,
  'HIREDATE': '1981-06-09',
  'SAL': 2450.0,
  'DEPTNO': '10'},
 {'_id': ObjectId('6232c6b91a203e5f7ba0da66'),
  'EMPNO': 7844,
  'ENAME': 'TURNER',
  'JOB': 'SALESMAN',
  'MGR': 7698,
  'HIREDATE': '1981-09-08',
  'SAL': 1500.0,
  'COMM': 0.0,
  'DEPTNO': '30'},
 {'_id': ObjectId('6232c6b91a203e5f7ba0da67'),
  'EMPNO': 7876,
  'ENAME': 'ADAMS',
  'JOB': 'CLERK',
  'MGR': 7788,
  'HIREDATE': '1987-07-13',
  'SAL': 1100.0,
  'DEPTNO': '20'},
 {'_id': ObjectId('6232c6b91a203e5f7ba0da68'),
  'EMPNO': 7900,
  'ENAME': 'JAMES',
  'JOB': 'CLERK',
  'MGR': 7698,
  'HIREDATE': '1981-12-03',
  'SAL': 950.0,
  'DEPTNO': '30'},
 {'_id': ObjectId('6232c6b91a203e5f7ba0da6a'),
  'EMPNO': 7934,
  'ENAME': 'MILLER',
  'JOB': 'CLERK',
  'MGR': 7782,
  'HIREDATE': '1982-01-23',
  'SAL': 1300.0,
  'DEPTNO': '10'}]

In [ ]:
# SELECT * FROM emp WHERE ENAME = SMITH OR ENAME = ALLEN
result_5 = db.emp.find(
    {
        "$or":[
            {
               "ENAME" : "SMITH" 
            },
            {
                "ENAME" : "ALLEN"
            }
        ]
    }
)
list(result_5)

[{'_id': ObjectId('6232c6b91a203e5f7ba0da5d'),
  'EMPNO': 7369,
  'ENAME': 'SMITH',
  'JOB': 'CLERK',
  'MGR': 7902,
  'HIREDATE': '1980-12-17',
  'SAL': 800.0,
  'DEPTNO': '20'},
 {'_id': ObjectId('6232c6b91a203e5f7ba0da5e'),
  'EMPNO': 7499,
  'ENAME': 'ALLEN',
  'JOB': 'SALESMAN',
  'MGR': 7698,
  'HIREDATE': '1981-02-20',
  'SAL': 1600.0,
  'COMM': 300.0,
  'DEPTNO': '30'}]

In [ ]:
# SELECT * FORM emp WHERE ENAME = SMITH AND JOB = CLERK
result_6 = db.emp.find(
    {
        "ENAME":"SMITH",
        "JOB":"CLERK"
    }
)
list(result_6)

[{'_id': ObjectId('6232c6b91a203e5f7ba0da5d'),
  'EMPNO': 7369,
  'ENAME': 'SMITH',
  'JOB': 'CLERK',
  'MGR': 7902,
  'HIREDATE': '1980-12-17',
  'SAL': 800.0,
  'DEPTNO': '20'}]

In [ ]:
import pandas as pd

In [ ]:
#SELECT * FROM emp WHERE SAL >= 2000 AND SAL< 4000
result_7 = db.emp.find(
    {
        "SAL":{
            "$gte" : 2000,
             
            "$lt":4000}

        
    },{"_id":0}
)
pd.DataFrame(result_7)

   EMPNO  ENAME      JOB   MGR    HIREDATE     SAL DEPTNO
0   7566  JONES  MANAGER  7839  1981-04-02  2975.0     20
1   7698  BLAKE  MANAGER  7839  1981-05-01  2850.0     30
2   7782  CLARK  MANAGER  7839  1981-06-09  2450.0     10
3   7788  SCOTT  ANALYST  7566  1987-06-28  3000.0     20
4   7902   FORD  ANALYST  7566  1981-12-03  3000.0     20

In [ ]:
#SELECT * FROM emp WHERE ENAME LIKE %%s%%
result_8 = db.emp.find(
    {
        "ENAME" : {
            "$regex": "S$"}
    },{"ENAME":1,"_id":0}
)

# ^앞에 붙이면 그 문자로 시작. 뒤에  $붙이면 그 문자로 끝. 아무것도 없으면 그 문자가 포함
pd.DataFrame(result_8)

   ENAME
0  JONES
1  ADAMS
2  JAMES

In [ ]:
#SELECT ENAME,JOB, SAL, DEPTNO FROM WHERE SAL > 1250 AND SAL <=3000 AND JOB= 
#ORDER BY ENAME

In [ ]:
result_9 = db.emp.find(
    {"SAL":{
            "$gt" : 1250,             
            "$lte":3000
            },
     "JOB" : "SALESMAN"
    },
    {"ENAME":1, "JOB":1, "SAL":1, "DEPTNO":1,"_id":0}
    
).sort("ENAME",-1)  # -1쓰면 내림차순

pd.DataFrame(result_9)

    ENAME       JOB     SAL DEPTNO
0  TURNER  SALESMAN  1500.0     30
1   ALLEN  SALESMAN  1600.0     30

In [14]:
db.emp.update_one(
    {
        "ENAME" : "SMITH"
    },
    {
        "$set" : {
            "SAL" :880
        }
    }
) # update_one 하면 중복데이터 있더라도 하나만 업데이트함.

In [16]:
result_10 = db.emp.find({
    "ENAME" : "SMITH"
},{"_id":0})
pd.DataFrame(result_10)

   EMPNO  ENAME    JOB   MGR    HIREDATE  SAL DEPTNO
0   7369  SMITH  CLERK  7902  1980-12-17  880     20

In [17]:
db.emp.delete_one(
    {
        "JOB" : "PRESIDENT"
    }
)

In [18]:
result_11 = db.emp.find({
    "JOB" : "PRESIDENT"
},{"_id":0})
pd.DataFrame(result_11)

Empty DataFrame
Columns: []
Index: []